OriginCEALNetwork(
  (ceal_1): CEALConv(100, 50, towers=1, edge_dim=1)
  (batch_norm_1): BatchNorm(50)
  (cealConvs): ModuleList()
  (batch_norms): ModuleList()
  (post_mlp): Sequential(
    (0): Linear(in_features=50, out_features=100, bias=True)
    (1): ReLU()
    (2): Linear(in_features=100, out_features=1, bias=True)
  )
)
